.main{
  display: -webkit-flex;
  display: -moz-flex;
  display: -ms-flex;
  display: -o-flex;
  display: flex;
 }

Свойства применяемые к флекс контейнерам
.main{
  flex-direction: row; - направление главной оси, по умолчанию с лева на право
                : row-reverse; - направление главной оси, с права на лево
                : column; - направление главной оси по вертикали с верху в низ
                : column-reverse; - направление главной оси по вертикали с низу вверх
                
  justify-content: flex-start; - куда прижимаются блоки, по умолчанию к началу главной оси
                 : flex-end; - блоки прижимаются к концу главной оси
                 : space-between; - рвномерное распределение от начала к концу по главной оси
                 : space-around; - равномерное распределение от начала к концу + отступы в начале и конце по главной оси
                 : center; - блоки выравниваются по центру главной оси
  
  align-items: stretch; - растягивание блоков, вдоль вспомогательной оси
             : center; - блоки распологаются по центру вспомогательной оси
             : flex-end; - блоки прижимаются  к концу встпомогательной оси
             : flex-end; - блоки прижимаются  к началу встпомогательной оси
             : baseline;  - выравнивание блоков относительно их базовай линии
	     
  flex-wrap: wrap; - разрешает перенос flex элементов, по умолчанию стоит none
  	   : wrap-reverse; - ряды начинают выстраиваться в обратном направлении (вверх)
	   
  align-content: stretch; - растягивание элементов вдоль поперечной оси
  	       : center; - ряды группируются по центру поперечной оси
	       : space-around; - равномерное распределение от начала к концу + отступы в начале и конце вдоль поперечной оси
	       : space-between; - рвномерное распределение от начала к концу вдоль поперечной оси
}


